[
  {
    "id": "LAYOUT-1",
    "category": "Layout — Top Bar",
    "description": "Replace the current sidebar header (logo, account, gallery link) with a fixed 56px top bar spanning full width. Left group: logo '2colors' + theme/dark-mode toggle pill (dark mode icon + divider + A/B/C/D theme buttons). Center: 'Today's Inspiration' label + daily inspiration word. Right group: Reset button (outline pill), Submit button (accent pill), divider, Gallery button (pill), Login/User button (pill).",
    "steps_to_verify": [
      "Top bar is visible at top of canvas editor page, ~56px tall, full width",
      "Left side shows logo text '2colors' followed by a grouped pill containing dark mode toggle + A/B/C/D theme buttons",
      "Center shows 'Today's Inspiration' label above the daily word in bold/display font",
      "Right side shows Reset, Submit!, Gallery, and Login/User buttons",
      "Sidebar no longer contains logo, account info, or gallery link",
      "Top bar persists on Gallery and Submission Detail pages (with contextual changes to center/right content)"
    ],
    "passes": true
  },
  {
    "id": "LAYOUT-2",
    "category": "Layout — Left Tools Panel",
    "description": "Replace the wide 300px left sidebar with a slim vertical icon-only tools panel. Contains all current action toolbar buttons (minus rotate) plus view toggles, grouped by dividers: close/hide | undo, redo | duplicate, delete | move up, move down, move left, move right | size decrease, size increase | mirror horizontal, mirror vertical | bring forward, send backward | grid lines toggle, off-canvas view toggle. Each as a ~40x40 icon button stacked vertically. Panel floats over the canvas (absolute positioned), does not push content. Collapsible with a small toggle button (wrench/tool icon) visible in top-left when closed.",
    "steps_to_verify": [
      "Left panel is a narrow vertical strip of icon buttons, not a wide sidebar with text",
      "Panel contains (grouped by dividers): close | undo, redo | duplicate, delete | move up/down/left/right | size decrease/increase | mirror H/V | bring forward, send backward | grid toggle, off-canvas toggle",
      "Each button is ~40x40px with icon only (no text labels)",
      "Panel is absolutely positioned over the canvas, does not shift the canvas layout",
      "Clicking the close button hides the panel and shows a small toggle button in top-left",
      "Clicking the toggle button reopens the panel with animation",
      "Undo/redo buttons appear disabled (reduced opacity) when history is empty",
      "Grid and off-canvas toggles show active/inactive state",
      "Mirror H/V, move, and size buttons require a shape to be selected"
    ],
    "passes": true
  },
  {
    "id": "LAYOUT-3",
    "category": "Layout — Right Layers Panel",
    "description": "Replace the current 300px right sidebar layer panel with a compact ~240px layers panel that floats over the canvas. Header: layers icon + 'Layers' text + count badge + group icon button + close button. Lists layers in reverse z-order with visibility toggle, color swatch, name, 4 ordering buttons (bring to front, move up, move down, send to back), delete per row. Supports grouping (collapsible groups with arrow, ungroup icon button). Group and ungroup use icon buttons, not text labels. Toggle button in top-right when closed showing layer count.",
    "steps_to_verify": [
      "Layers panel is ~240px wide, absolutely positioned on the right, floating over canvas",
      "Header shows layers icon, 'Layers' label, count badge, group icon button, close button",
      "Each layer row shows: visibility (eye) icon, color swatch, shape name, 4 ordering buttons (bring to front, move up, move down, send to back), delete button",
      "Bring to front / send to back buttons are disabled when layer is already at top/bottom",
      "Layers listed in reverse z-order (highest z-index at top)",
      "Can select 2+ layers and click Group icon button to create a group",
      "Groups are collapsible with arrow toggle, show child count, have Ungroup icon button",
      "Group and ungroup controls are icon buttons, not text labels",
      "When closed, a toggle button in top-right shows the layer count (e.g. '3')",
      "Panel does not push canvas layout — it overlays"
    ],
    "passes": true
  },
  {
    "id": "LAYOUT-4",
    "category": "Layout — Bottom Floating Toolbar",
    "description": "Add a floating horizontal pill toolbar at bottom center of the canvas editor. Height ~48px, backdrop blur, surface color background. Sections separated by vertical dividers: (1) Tool mode: Select button (cursor icon) + 2 daily shape buttons (dynamically showing today's assigned shape types with corresponding icons, e.g. 'Blade', 'Crescent', 'Star', etc. — not hardcoded to circle/square) — active tool has border+shadow. (2) 'Color' label + 3 color swatches (28x28, daily challenge colors) — selected has border. (3) 'Background' label + 4 background color buttons (3 daily colors + cream/white) — selected has border. Spring animation entrance from bottom.",
    "steps_to_verify": [
      "Floating pill toolbar visible at bottom center of canvas editor",
      "Has backdrop blur effect on background",
      "Left section: Select (cursor icon) + 2 daily shape buttons (dynamically labeled/iconed per today's challenge) — clicking activates tool mode",
      "Active tool button has visible border and/or shadow distinction",
      "Middle section: 'Color' label + 3 color swatches matching daily challenge colors",
      "Right section: 'Background' label + 4 background color swatches (3 daily + cream/white)",
      "Sections separated by thin vertical dividers",
      "Selected color/background swatch has a visible border indicator",
      "Toolbar animates in from bottom with spring physics on page load"
    ],
    "passes": true
  },
  {
    "id": "STAMP-1",
    "category": "Stamp Mode — Shape Creation",
    "description": "Implement stamp mode for adding shapes. When a shape tool is selected in the bottom toolbar (any of the 45 supported shape types — toolbar dynamically shows today's 2 assigned shapes), the editor enters stamp mode. Clicking the canvas places a shape at the click position with default size (~60px in canvas coordinates, i.e. scales with zoom). Dragging sizes the shape (drag distance * 2 = size in canvas coords, min 20px). A ghost cursor (60x60 semi-transparent preview of the shape) follows the mouse in canvas-transformed coordinates (respecting current zoom/pan) in the currently selected color. A hint text appears above the toolbar: 'Click to place · Drag to size · Esc to select'. Pressing Esc or V returns to select mode. The shape color comes from the currently selected color swatch in the bottom toolbar. Switching color via the bottom toolbar color buttons while in stamp mode immediately updates the ghost cursor color.",
    "steps_to_verify": [
      "Clicking a shape tool in bottom toolbar enters stamp mode (button shows active state)",
      "In stamp mode, a semi-transparent ghost shape (~60x60, opacity ~0.35) follows the mouse cursor over the canvas",
      "Clicking the canvas places a shape at the click position with default size ~60px",
      "Click-and-drag creates a shape sized by drag distance (min 20px)",
      "Shape is created with the color currently selected in the bottom toolbar color swatches",
      "Hint text 'Click to place · Drag to size · Esc to select' appears above the toolbar during stamp mode",
      "Pressing Esc or V exits stamp mode and returns to select mode",
      "Newly placed shape has a spring animation (scale 0→1)"
    ],
    "passes": true
  },
  {
    "id": "THEME-1",
    "category": "Theme System — CSS Variables Infrastructure",
    "description": "Implement a CSS custom properties-based theming system supporting 4 themes (A/B/C/D) x 2 modes (light/dark). Theme switching is done by swapping data attributes on the root element (data-theme='a|b|c|d' and data-mode='light|dark'). All visual theming (colors, borders, radius, shadows, fonts) must use CSS custom properties — minimize JS conditionals for styling, though conditional rendering logic (e.g. different icons or layout behavior) in JS is acceptable. All existing components must be refactored to use CSS custom properties instead of hardcoded colors/values. Variables must cover: backgrounds (--bg, --surface, --surface-hover), text (--text, --text-muted, --accent, --accent-text), borders (--border, --border-light, --border-w, --border-w-heavy), border radius (--radius-sm through --radius-2xl, --radius-pill), shadows (--card-shadow, --btn-shadow, --modal-shadow), selection UI (--sel-border, --sel-handle-fill, --sel-handle-stroke, --sel-handle-size, --sel-rotate-color, --sel-hover-fill, --sel-dash), patterns (--pattern-image, --pattern-size, --pattern-opacity), fonts (--font-body, --font-display), and overlay/selected states. Theme changes transition smoothly via CSS transition (~0.35s) on color, background, border, and shadow properties only (not fonts or pattern images, which swap instantly to avoid reflow jank). Font loading strategy: eagerly load the active theme's font(s); lazy-load other theme fonts on demand when the user switches themes.",
    "steps_to_verify": [
      "Root element has data-theme and data-mode attributes",
      "All 4 themes define the full set of CSS variables listed above",
      "Each theme has both light and dark mode variant definitions",
      "Switching themes changes all UI colors, borders, radii, shadows, and fonts simultaneously",
      "Color/background/border/shadow transitions are smooth (~0.35s); fonts and patterns swap instantly",
      "Components use CSS variables (not hardcoded colors) for all themeable properties",
      "All visual theming (colors, borders, radius, shadows, fonts) handled via CSS variables; JS conditionals minimized to non-visual logic only",
      "All existing components have been refactored to read from CSS variables"
    ],
    "passes": true
  },
  {
    "id": "THEME-2",
    "category": "Theme System — Theme A (Pop Art)",
    "description": "Theme A: Deep purple background (#2D1B69 dark variant), hot pink accent (#FF3366), cyan highlights (#33CCFF). Fonts: Fredoka (body), Lilita One (display). Border radius: 8-24px (generously rounded). Shadows: chunky 4-8px offsets. Background pattern: colorful dot pattern overlay. Both light and dark mode variants.",
    "steps_to_verify": [
      "Selecting theme A applies deep purple / hot pink / cyan color palette",
      "Body text uses Fredoka font, headings/display text use Lilita One",
      "Corners are generously rounded (8-24px radius range)",
      "Shadows have a chunky, offset appearance (4-8px)",
      "A dot pattern overlay is faintly visible on the page background",
      "Light mode uses lighter background with the same accent colors",
      "Dark mode uses the deep purple background"
    ],
    "passes": true
  },
  {
    "id": "THEME-3",
    "category": "Theme System — Theme B (Minimal Swiss)",
    "description": "Theme B: Black/dark gray primary (#222222), red accent (#E63322). Font: DM Sans for both body and display. Border radius: 2-4px (barely rounded). Shadows: subtle 1-3px. Selection uses dashed border pattern. Pure minimalist aesthetic. Both light and dark mode variants.",
    "steps_to_verify": [
      "Selecting theme B applies black/dark gray + red accent color palette",
      "All text uses DM Sans font",
      "Corners are barely rounded (2-4px radius)",
      "Shadows are subtle and professional (1-3px)",
      "Selection overlay uses dashed border pattern instead of solid",
      "Overall aesthetic is clean, minimal, professional"
    ],
    "passes": true
  },
  {
    "id": "THEME-4",
    "category": "Theme System — Theme C (Soft Cloud)",
    "description": "Theme C: Warm sage green (#9DC4B0), coral accent (#E07A5F), cream backgrounds. Font: Nunito (rounded, warm). Border radius: 12-28px (very rounded). Shadows: diffuse, soft. Subtle circular pattern overlay. Dreamy, gentle feel. Both light and dark mode variants.",
    "steps_to_verify": [
      "Selecting theme C applies sage green / coral / cream color palette",
      "All text uses Nunito font",
      "Corners are very rounded (12-28px radius)",
      "Shadows are diffuse and soft, not sharp",
      "A subtle circular pattern overlay may be visible on the background",
      "Overall aesthetic is warm, dreamy, gentle"
    ],
    "passes": true
  },
  {
    "id": "THEME-5",
    "category": "Theme System — Theme D (Brutalist)",
    "description": "Theme D: Neon yellow accent (#CCFF00), stark black backgrounds. Font: Space Mono (monospace). Border radius: 0px (no rounding at all). Shadows: thick 6-10px offsets. Heavy 3-4px borders. Raw, high-contrast aesthetic. Both light and dark mode variants.",
    "steps_to_verify": [
      "Selecting theme D applies neon yellow / black color palette",
      "All text uses Space Mono monospace font",
      "Corners have zero border radius (sharp edges everywhere)",
      "Shadows are thick with large offsets (6-10px)",
      "Borders are heavier than other themes (3-4px)",
      "Overall aesthetic is raw, brutalist, high-contrast"
    ],
    "passes": true
  },
  {
    "id": "THEME-6",
    "category": "Theme System — Theme Switcher UI",
    "description": "Theme switcher in the top bar: a grouped pill containing a dark mode toggle button (sun/moon icon) + a thin vertical divider + four theme buttons labeled A, B, C, D. The active theme button has a distinct selected state (filled background). Clicking a theme button instantly switches the theme. Clicking the dark mode toggle switches between light and dark mode. Theme preference should be persisted (localStorage).",
    "steps_to_verify": [
      "Theme pill is visible in the top bar, left area near the logo",
      "Contains: dark mode toggle (sun icon in dark mode, moon in light) + divider + A/B/C/D buttons",
      "Active theme button has a visually distinct selected state",
      "Clicking A/B/C/D switches theme with smooth transition",
      "Clicking dark mode toggle switches between light and dark modes",
      "Theme and mode preference persists across page reloads (localStorage)"
    ],
    "passes": true
  },
  {
    "id": "THEME-7",
    "category": "Theme System — Selection Handle Theming & Restructuring",
    "description": "Restructure and theme transform/selection handles. Structural changes: resize handles increase from 4 (corners only) to 8 (corners + midpoints). Rotation handles reduce from 4 (all sides) to 1 (top center only, with a visible stem line connecting to the bounding box). Handles scale to 1.3x on hover. Multi-select shows minimal dashed outlines only (not full controls per shape). All handle styling is theme-driven via CSS variables: selection border color/width/dash pattern, handle fill/stroke colors, handle size (7-10px), handle shape (borderRadius — circular for themes A/C, square for theme D, barely rounded for theme B), rotation handle/stem color, hover fill. E.g., Theme B uses dashed selection borders; Theme D uses thick solid borders with square handles; Theme A uses rounded handles with accent colors.",
    "steps_to_verify": [
      "8 resize handles visible when shape selected (4 corners + 4 midpoints)",
      "1 rotation handle at top center with a visible stem line (not 4 on all sides)",
      "Handles scale to 1.3x on hover",
      "Multi-select shows minimal dashed outlines per shape, not full handle controls",
      "Selection border style changes when switching themes (solid vs dashed, color, width)",
      "Resize handle size varies by theme (7-10px range)",
      "Handle shape varies by theme (circular for A/C, square for D, barely rounded for B)",
      "Handle fill and stroke colors match the active theme palette",
      "Rotation handle and stem color is theme-specific",
      "Theme D handles appear angular/square; Theme C handles appear softer/rounder"
    ],
    "passes": true
  },
  {
    "id": "PANEL-1",
    "category": "Panels — Collapsible Side Panels",
    "description": "Both left tools panel and right layers panel are collapsible. They animate open/close using spring physics (AnimatePresence). When closed, a small toggle button is visible at the respective edge (wrench icon top-left for tools, layers icon + count badge top-right for layers). Panels float over the canvas — they do not push/resize the canvas area. Panel state (open/closed) should persist.",
    "steps_to_verify": [
      "Left panel has a close button that hides it with animation",
      "When left panel is closed, a toggle button (wrench/tool icon) appears in top-left",
      "Right panel has a close button that hides it with animation",
      "When right panel is closed, a toggle button (layers icon + count) appears in top-right",
      "Panel open/close uses spring animation (not linear/ease)",
      "Canvas area does not resize or shift when panels open/close",
      "Panel open/closed state persists across page reloads"
    ],
    "passes": true
  },
  {
    "id": "INFO-1",
    "category": "Info — Keyboard Shortcuts Popover",
    "description": "Small '?' button (30x30) in the bottom-left corner of the canvas editor. Clicking opens a popover listing keyboard shortcuts in a two-column layout (key | action). Must show the actual app's correct bindings (not the design exploration's incomplete list): V/Esc → Select mode, Ctrl/Cmd+Z → Undo, Ctrl/Cmd+Shift+Z → Redo, D → Duplicate, Backspace/Del → Delete, Arrow keys → Move (Shift = 10px), ,/. → Rotate CCW/CW, M → Mirror horizontal, Shift+M → Mirror vertical, G → Grid toggle, Shift+Click → Multi-select, Space+Drag → Pan, Ctrl/Cmd+Scroll → Zoom. A 'Customize shortcuts' button with gear icon at the bottom opens the existing keyboard settings modal. Popover closes when clicking elsewhere.",
    "steps_to_verify": [
      "Small '?' button visible in bottom-left corner of canvas editor",
      "Clicking opens a popover/tooltip with keyboard shortcuts",
      "Shortcuts displayed in two-column layout: key binding on left, action on right",
      "All shortcuts from the actual app are listed with correct bindings (V/Esc, Ctrl+Z, Ctrl+Shift+Z, D, Backspace, Arrows, comma/period, M, Shift+M, G, Shift+Click, Space+Drag, Ctrl+Scroll)",
      "'Customize shortcuts' button at bottom opens the existing keyboard settings modal",
      "Clicking outside the popover closes it",
      "Popover animates in (scale/fade)"
    ],
    "passes": true
  },
  {
    "id": "ZOOM-1",
    "category": "Zoom — Controls Relocation and Range",
    "description": "Move zoom controls to bottom-right corner of the canvas area. Compact horizontal pill with: + button, zoom percentage display (clickable to reset to 100%), - button, and 1:1 reset button. Extend zoom range from current 0.5x-2x to 0.25x-4x.",
    "steps_to_verify": [
      "Zoom controls are positioned in the bottom-right corner of the canvas area",
      "Controls are a compact horizontal pill: +, zoom %, -, 1:1",
      "Clicking + zooms in, clicking - zooms out",
      "Clicking the percentage display or 1:1 button resets zoom to 100%",
      "Zoom range extends from 0.25x (25%) to 4x (400%)",
      "Buttons disable at min/max zoom"
    ],
    "passes": false
  },
  {
    "id": "USER-1",
    "category": "User Menu — Dropdown",
    "description": "When logged in, top-right of top bar shows avatar circle (user initial letter) + user name + chevron. Clicking opens a dropdown with spring animation. Dropdown contains: header with large avatar + name + 'N following · N followers' stats, Following/Followers tabs (with counts, active tab has accent underline), scrollable friends list (avatar + name, hover highlight), 'Add by nickname...' input + accent 'Add' button, and 'Log out' button at bottom. When logged out, a 'Log in' pill button appears instead.",
    "steps_to_verify": [
      "When logged in: avatar circle + name + chevron visible in top-right of top bar",
      "Clicking opens a dropdown that animates in with spring physics",
      "Dropdown header shows larger avatar, display name, 'N following · N followers'",
      "Following/Followers tabs switch the friend list, active tab has accent underline",
      "Friend rows show avatar, name, hover highlights",
      "Text input for 'Add by nickname...' with accent 'Add' button",
      "'Log out' button at bottom of dropdown",
      "When logged out: 'Log in' pill button shown instead of avatar/name",
      "Clicking outside the dropdown closes it"
    ],
    "passes": false
  },
  {
    "id": "GALLERY-1",
    "category": "Gallery — Top Bar and Tab Structure",
    "description": "Gallery page has the same top bar as canvas editor (logo + theme toggles on left) but center shows 'Gallery' title and right shows '< Back to canvas' button. Below the top bar: a pill-style tab bar with 4 tabs — My Submissions, Winners, Wall, Friends. Active tab has a distinct selected state (filled background). Theme system applies to the entire gallery page.",
    "steps_to_verify": [
      "Gallery page top bar: left has logo + theme toggles, center has 'Gallery' title, right has 'Back to canvas' button",
      "'Back to canvas' button navigates back to the canvas editor",
      "Tab bar shows My Submissions, Winners, Wall, Friends in a pill/segmented style",
      "Active tab is visually distinct (filled/highlighted)",
      "Theme changes apply consistently across the gallery page",
      "Gallery page uses the same theme as the canvas editor (shared state)"
    ],
    "passes": true
  },
  {
    "id": "GALLERY-2",
    "category": "Gallery — My Submissions Tab",
    "description": "Calendar view showing one month at a time. Each day cell shows: the day number as a badge, and if a submission exists, the artwork thumbnail fills the cell. Empty days show just the date number + small indicator. Today's cell is highlighted with accent border and shows 'Create!' CTA if no submission exists. Footer shows total submissions count and medal tallies (gold/silver/bronze counts).",
    "steps_to_verify": [
      "Calendar grid shows Mon-Sun columns for the selected month",
      "Days with submissions show artwork thumbnails filling the cell",
      "Day number appears as a small badge in the corner of each cell",
      "Empty days show the date number and appear muted",
      "Today's cell has an accent-colored border",
      "Today's cell shows 'Create!' CTA if user hasn't submitted today",
      "Footer shows 'Total submissions: N' and medal counts",
      "Month navigation arrows (< >) switch months"
    ],
    "passes": false
  },
  {
    "id": "GALLERY-3",
    "category": "Gallery — Winners Tab",
    "description": "Calendar view where every day shows the winning artwork thumbnail with a crown/trophy emoji. Footer shows 'Winners this month: N' and 'N unique winners'. Days still in progress show status text like 'Voting...' or 'Creating...'. Future days are empty.",
    "steps_to_verify": [
      "Each past day cell shows a winning artwork thumbnail with crown emoji",
      "Days currently in voting show 'Voting...' status",
      "Today shows 'Creating...' if still in creation phase",
      "Future days are empty/muted",
      "Footer shows total winners count and unique winners count for the month",
      "Clicking a day cell navigates to that day's winner detail"
    ],
    "passes": false
  },
  {
    "id": "GALLERY-4",
    "category": "Gallery — Wall Tab",
    "description": "Wall tab has a Grid/Calendar toggle. Calendar view shows submission counts per day as colored number badges. Grid view shows: date navigation with previous/next arrows + 'Today' button, a Grid/Calendar toggle, a sort dropdown (Newest/Oldest/Random), and artwork cards in a responsive grid. Each card shows the artwork thumbnail, author name, date, and trophy badge for winners.",
    "steps_to_verify": [
      "Grid/Calendar toggle switches between two view modes",
      "Calendar view: each day cell shows a colored badge with submission count for that day",
      "Grid view: date navigation with < and > arrows + 'Today' button",
      "Grid view: sort dropdown with Newest, Oldest, Random options",
      "Grid view: artwork cards show thumbnail, author name, date",
      "Winners have a trophy badge on their card",
      "Clicking a card navigates to the submission detail page"
    ],
    "passes": false
  },
  {
    "id": "GALLERY-5",
    "category": "Gallery — Friends Tab",
    "description": "Grid layout of friend submissions as cards. Each card shows artwork thumbnail, author name, date, and trophy badge for winners. Has Grid/Calendar toggle + Newest/Oldest/Random sort dropdown. Scrollable feed-style layout.",
    "steps_to_verify": [
      "Friends tab shows a grid of artwork cards from friends",
      "Each card shows: artwork thumbnail, friend name, date, trophy badge if winner",
      "Grid/Calendar toggle is available",
      "Sort dropdown with Newest/Oldest/Random options",
      "Cards are clickable and navigate to submission detail",
      "Layout is responsive — cards reflow based on viewport width"
    ],
    "passes": false
  },
  {
    "id": "SUBMISSION-1",
    "category": "Submission Detail — Page Redesign",
    "description": "Submission detail page: top bar with logo + theme toggles | centered 'Submission' title | '< Gallery' back button. Content: date as large heading, metadata line (@username · 'Submission' · 'Following' badge). Two-column layout: large artwork preview (left) + stacked info cards (right). Info cards: (1) Inspiration word + color swatches + shapes used with icon+count, (2) Ranking with trophy + '#N / total' + 'Winner of the day!' text, (3) Submission Stats (shapes used, submitted date), (4) Export & Share (Copy Link button). 'Like' button below artwork (heart icon + text, pill style).",
    "steps_to_verify": [
      "Top bar: logo + theme toggles left, 'Submission' center, '< Gallery' back button right",
      "Date displayed as large heading (e.g. 'Tuesday, February 24, 2026')",
      "Metadata line shows @username, 'Submission' label, and relationship badge (Following/etc.)",
      "Two-column layout: artwork on left, info cards stacked on right",
      "Challenge details card shows inspiration word, color swatches, shapes with counts",
      "Ranking card shows trophy emoji, rank position, winner text if applicable",
      "Stats card shows shapes used count and submission date",
      "Export card has 'Copy Link' button with link icon",
      "'Like' button below artwork with heart icon and text"
    ],
    "passes": false
  },
  {
    "id": "ANIM-1",
    "category": "Animation — Shape Placement",
    "description": "Newly placed shapes animate in with spring physics: scale from 0 to 1. Use motion/framer-motion spring configuration (stiffness ~400, damping ~15). Must respect prefers-reduced-motion (skip animation when reduced motion is preferred).",
    "steps_to_verify": [
      "Placing a new shape shows a scale-up animation (not instant appearance)",
      "Animation uses spring physics (slight overshoot, natural feel)",
      "Animation completes in a reasonable time (~300-500ms)",
      "Animation is skipped when prefers-reduced-motion is enabled"
    ],
    "passes": false
  },
  {
    "id": "ANIM-2",
    "category": "Animation — Panel Transitions",
    "description": "Side panels (tools, layers) use AnimatePresence for open/close transitions. Open: spring animation sliding in from the edge. Close: multi-step exit (slight opposite movement, then slide out). All buttons and interactive elements have hover feedback (background change, scale, shadow, or transform).",
    "steps_to_verify": [
      "Opening a panel animates it sliding in from the edge with spring physics",
      "Closing a panel animates it sliding out (not instant disappearance)",
      "Buttons throughout the UI have visible hover state changes",
      "Theme switcher transitions smoothly between themes (~0.35s)",
      "User menu dropdown animates in with spring (scale + translate)"
    ],
    "passes": false
  },
  {
    "id": "ANIM-3",
    "category": "Animation — Ghost Cursor",
    "description": "In stamp mode, a ghost cursor (60x60 semi-transparent shape preview) follows the mouse position over the canvas. Opacity ~0.35 when hovering, fades to 0 when dragging to create a shape. Uses the currently selected shape type and color.",
    "steps_to_verify": [
      "In stamp mode, a ghost preview shape follows the mouse cursor",
      "Ghost shape matches the selected shape type (circle/square) and color",
      "Ghost is semi-transparent (~0.35 opacity)",
      "Ghost disappears or fades out during a drag-to-size operation",
      "Ghost does not appear outside the canvas area"
    ],
    "passes": false
  },
  {
    "id": "REMOVE-1",
    "category": "Removal — Old Sidebar Content",
    "description": "Remove from the left sidebar (which is being replaced): logo/header section, account/auth section, gallery link, inspiration word display, background color section, shape color section, add shape section (shape type + color buttons), save/reset action buttons, grid lines toggle, off-canvas toggle, controls documentation list, and the dark/light theme toggle at bottom. All of these functions either move to the new top bar, bottom toolbar, info popover, or tools panel.",
    "steps_to_verify": [
      "Old wide left sidebar (300px with text labels and multiple sections) is completely removed",
      "Logo/branding lives in the top bar",
      "Auth/login functionality lives in the top bar user menu",
      "Gallery link lives in the top bar",
      "Inspiration word lives in the top bar center",
      "Background + shape color selection lives in the bottom toolbar",
      "Shape adding uses stamp mode from bottom toolbar",
      "Save/Submit lives in the top bar",
      "Reset lives in the top bar",
      "Theme toggle lives in the top bar theme pill",
      "Keyboard shortcuts info lives in the '?' popover"
    ],
    "passes": true
  },
  {
    "id": "REMOVE-2",
    "category": "Removal — Old Action Toolbar",
    "description": "Remove the current floating ActionToolbar at the top center of the canvas (which contains undo/redo, duplicate/delete, movement arrows, rotation, size, mirror buttons in a horizontal bar). These functions move to the left tools panel: undo, redo, duplicate, delete, move up/down/left/right, size decrease/increase, mirror H/V, bring forward, send backward. Rotate CW/CCW stays as keyboard shortcuts + rotation handles only (no button). Grid lines and off-canvas view toggles also move from the old sidebar to the left tools panel.",
    "steps_to_verify": [
      "Old top-center floating action toolbar is removed",
      "Undo, redo, duplicate, delete, move, size, mirror, bring forward, send backward are all in the left tools panel",
      "Rotation is available via keyboard shortcuts (comma/period) and direct manipulation (rotation handles) only — no button",
      "Grid lines and off-canvas toggles are in the left tools panel (moved from old sidebar)",
      "No orphaned toolbar UI remains from the old design"
    ],
    "passes": false
  },
  {
    "id": "STAMP-2",
    "category": "Stamp Mode — Empty Canvas Prompt",
    "description": "When the canvas is empty and the editor is in select mode, show centered semi-transparent instructional text: 'Pick a shape below to start creating.' Text disappears when the first shape is added or when entering stamp mode. Important: text must only appear after canvas state has been hydrated from Supabase (not during loading), to avoid a flash on canvases that have saved shapes.",
    "steps_to_verify": [
      "On an empty canvas in select mode, centered text 'Pick a shape below to start creating' is visible",
      "Text is semi-transparent (not full opacity)",
      "Text disappears immediately when a shape is added",
      "Text disappears when entering stamp mode (clicking Circle or Square in bottom toolbar)",
      "Text reappears if all shapes are deleted and editor returns to select mode",
      "Text does NOT flash during initial canvas state loading from Supabase"
    ],
    "passes": false
  },
  {
    "id": "SHORTCUT-1",
    "category": "Shortcuts — Default Key Remapping",
    "description": "Remap default keyboard shortcuts: V → Select mode (was mirror vertical), M → Mirror horizontal (was H), Shift+M → Mirror vertical (was V). All other default bindings unchanged. Users can still customize all shortcuts via the keyboard settings modal.",
    "steps_to_verify": [
      "Pressing V or Esc exits stamp mode and enters select mode",
      "Pressing M mirrors the selected shape horizontally",
      "Pressing Shift+M mirrors the selected shape vertically",
      "Old bindings (H for mirror horizontal, V for mirror vertical) no longer active by default",
      "Keyboard settings modal reflects the new defaults",
      "User can still rebind all shortcuts via the keyboard settings modal"
    ],
    "passes": true
  }
]
